Repository: MarimerLLC/csla
Catalog: Source/Csla.Shared.Resources/Resources.*.resx
Languages: ca_es, de, fr, he_il, hu, it, km_kh, nl, pt, pt_br, sr, uk_ua, zh_hans

# TypeLoadException
source: Failed to load type '{0}'
ca_es: Error al carregar el tipus '{0}'
de: Laden des Typs '{0}' fehlgeschlagen
fr: Echec lors du chargement du type '{0}'
hu: '{0}' típus betöltése nem sikerült
km_kh: បរាជ័យក្នុងការផ្ទុកទិន្នន័យប្រភេទ '{0}'
nl: Laden van het type '{0}' mislukt
pt: Não conseguiu carregar o tipo '{0}'
pt_br: Falha ao carregar o tipo '{0}'
uk_ua: Не вдалося завантажити тип '{0}'

# NoSuchFactoryMethod
source: No such factory method:{0}
ca_es: No existeix aquest mètode : {0}
de: Unbekannte Factory-Methode:{0}
fr: le factory méthode:{0} n'existe pas
hu: Nincs ilyen gyári metódus: {0}
km_kh: មិនមាន វិធីសាស្រ្តបង្កើត :{0} នេះទេ ។
nl: De volgende factory methode bestaat niet:{0}
pt: O método "factory" não existe:{0}
pt_br: Não há tal método de fábrica: {0}

# StringMinLengthRule
source: {0} must be at least {1} characters
ca_es: {0} no pot ser menor de {1} caràcters
de: {0} muss mindestens aus {1} Zeichen bestehen
fr: {0} doit au moins avoir {1} caractères
hu: {0} nem lehet rövidebb {1} karakternél
km_kh: {0} មិនអាចតិចជាង {1} តួអក្សរ
nl: {0} moet minstens uit {1} karakters bestaan
pt: {0} deve ter pelo menos {1} caracteres
pt_br: {0} deve ter pelo menos {1} caracteres
uk_ua: Поле '{0}' повинно бути не менше {1} символу(ів)

# EditLevelMismatchException
source: Edit level mismatch in {0}
ca_es: Discrepància en el nivell d'edició en {0}
de: Keine Übereinstimmung der Edit-Level in {0}
hu: Szerkesztési szint eltérés - {0}
km_kh: កំរិតកែប្រើមិនដូចគ្នា {0}
pt: Discordância no nível de edição em {0}
pt_br: Discordancia no nível de edição em {0}

# MethodExecuteNotAllowed
source: Method execution not allowed
ca_es: Execució de mètode no permès
de: Ausführen der Methode nicht erlaubt
fr: L'éxécution de cette méthode n'est pas autorisée
hu: Metódus végrehajtása nem megengedett
km_kh: វិធីសាស្រ្ត មិនត្រូវបានអនុញ្ញាត្តិអោយប្រតិបត្តិ
pt: Não é permitido executar o método
pt_br: Executar método não permitido
uk_ua: Виконання методу заборонено

# FilterRequiredException
source: Filter parameter and filter provider are required
de: Filter-Parameter und Filter-Provider erforderlich
hu: A szűrő-paraméter és a szűrő-ellátó kötelező
pt: São exigidos o parâmetro e o fornecedor do filtro
pt_br: Parâmetro Filter e provedor de filtro são necessarios

# PropertyLoadException
source: Property load or set failed for property {0} ({1})
de: Das Laden oder Setzen einer Eigenschaft ist fehlgeschlagen für Eigenschaft {0} ({1})
hu: Tulajdonság betöltése vagy írása nem sikerült: {0} ({1})
pt: Carregar ou estabelecer propriedade falhou para a propriedade {0} ({1})
pt_br: Carregar ou estabelecer propriedade falhou para a propriedade {0} ({1})

# UserNotAuthorizedException
source: User not authorized to {0} object type {1}
de: Der Benutzer ist nicht berechtigt für Aktion {0} mit Objekttyp {1}
hu: Nincs felhatalmazása {0} műveletre {1} objektumtípusnál
pt: Utilizador não autorizado a executar a acção [{0}] em objectos do tipo {1}
pt_br: Usuario não autorizado a executar a ação [{0}] em objeto do tipo {1}
uk_ua: Користувач не має права для операції '{0}' об'єкту типу '{1}'

# DatabaseNameNotFound
source: Database name not found in config file ({0})
de: Datenbankname in Config-Datei nicht gefunden ({0})
hu: Az adatbázis azonosító nem található a .config fájlban ({0})
pt: Nome da base de dados não foi encontrado no ficheiro de configuração ({0})
pt_br: Nome do banco de dados não encontrado no arquivo de configuração ({0})

# PropertyNotRegistered
source: One or more properties are not registered for this type
de: Eigenschaft/en nicht registriert für diesen Typ
hu: Ennek a típusnak egy vagy több tulajdonsága nincs nyilvántartva
pt: Uma ou mais propriedades não estão registadas para este tipo
pt_br: Uma ou mais propriedades não registradas para este tipo

# FactoryTypeNotFoundException
source: Factory type or assembly could not be loaded ({0})
de: Factory-Typ oder Assembly konnte nicht geladen werden ({0})
pt: Não foi possível carregar o tipo "factory" ou "assembly" ({0})
pt_br: Fábrica de tipo ou assembly não pode ser carregado ({0})

# CannotSerializeCollectionsNotOfIMobileObject
source: Cannot serialize collections not of type IMobileObject
de: Collections, die nicht IMobileObject implementieren, können nicht serialisiert werden
pt: Não se podem serializar colecções do tipo IMobileObject
pt_br: Não se pode serializar coleção do tipo IMobileObject

# BusyObjectsMayNotBeMarkedBusy
source: Objects that are marked busy may not be marked busy again
de: Bereits als busy markierte Objekte dürfen nicht nochmals als busy markiert werden
pt: Objecto marcado como ocupado não pode ser marcado como ocupado novamente
pt_br: Objeto marcado como ocupado não pode ser marcado como ocupado novamente

# BusyObjectsMayNotBeSaved
source: Objects that are marked busy may not be saved
de: Als busy markierte Objekte dürfen nicht gespeichert werden
pt: Objecto marcado como ocupado não pode ser guardado
pt_br: Objeto marcado como ocupado não pode ser salvo
uk_ua: Обєкт зайнятий і не може бути в даний момент збережений

# MobileFormatterUnableToDeserialize
source: The Type '{0}' was unable to be deserialized, double check that the assembly containing this class has the same name on the Client and Server and that it is referenced by your server application
de: Der Typ '{0}' konnte nicht deserialisiert werden, stellen Sie sicher, dass die Assembly, die diesen Typ enthält, auf Client und Server den selben Namen trägt, und dass Ihre Server Applikation darauf verweist
pt: Não foi possível serializar o tipo '{0}'. Verifique se a "assembly" que contém esta classe tem o mesmo nome no cliente e no servidor, e que é referenciada no servidor
pt_br: O tipo '{0}' foi incapaz de se de-serializar certifique-se de que o assembly que contem esta classe tem o mesmo nome no Cliente e no Servidor e que é referenciado pela aplicação servidora

# MustImplementIMobileObject
source: Type {0} must implement IMobileObject
de: Typ {0} muss IMobileObject implementieren
pt: Tipo {0} deve implementar IMobileObject
pt_br: Tipo {0} deve implementar IMobileObject
uk_ua: Тип {0} повинен реалізовувати інтерфейс IMobileObject

# ObjectNotSerializableFormatted
source: Object not serializable ({0})
de: Das Objekt ist nicht serialisierbar ({0})
fr: Objet non sérialisable ({0})
pt: Objecto não serializável ({0})
pt_br: Objeto não serializavel ({0})

# AuthenticationProviderDoesNotImplementIAuthorizeDataPortal
source: Csla Authentication Provider specified does not implement IAuthorizeDataPortal
de: Angegebener Csla Authentication Provider implementiert nicht IAuthorizeDataPortal
pt: Csla Authentication Provider especificado não implementa IAuthorizeDataPortal
pt_br: Csla Authentication Provider especificado não implementa IAuthorizeDataPortal

# AuthorizationProviderNameNotSpecified
source: Csla Authorization Provider App Setting name not specified
de: Einstellung (App Setting) für Csla Authorization Provider ist nicht festgelegt
pt: Csla Authorization Provider App Setting não especifica "name"
pt_br: Nome [Csla Authorization Provider App Setting] não especificado

# ClientQueryIsInvalid
source: The client query is invalid:
de: Die Client-Anfrage ist ungültig:
pt: A "query" do cliente não é válida:
pt_br: O query cliente é inválido:
uk_ua: Клієнтський запит є неприпустимим:

# ConstructorsWithParametersNotSupported
source: Constructor with parameters are not supported
de: Konstruktoren mit Parametern werden nicht unterstützt
pt: Construtor com parâmetros não é suportado
pt_br: Construtor com parâmetros não é suportado

# CreateMethodNameNotSpecified
source: Create method name not specified in MobileFactory attribute
de: Create Methodenname in MobileFactory Attribut nicht angegeben
pt: Nome do método "create" não foi especificado no atributo MobileFactory
pt_br: Nome do método para criar (create) não estabelecido no atributo MobileFactory

source: Csla Authentication Provider not set!
de: Csla Authentication Provider nicht gesetzt!
pt: Csla Authentication Provider não estabelecido!
pt_br: [Csla Authentication Provider] não estabelecido!

source: Default Constructor
de: Standard Konstruktor
pt: Construtor pré-definido
pt_br: Construtor default

# DeleteMethodNameNotSpecified
source: Delete method name not specified in MobileFactory attribute
de: Delete Methodenname in MobileFactory Attribut nicht angegeben
pt: Nome do método "delete" não foi especificado no atributo MobileFactory
pt_br: Nome do método para deletar (delete) não estabelecido no atributo MobileFactory

# ExceptionOccurredDuringSaveOperation
source: An exception ocurred during the save operation
de: Eine Ausnahme ist während des Speichervorgangs aufgetreten
pt: Ocorreu um erro durante a operação de guardar
pt_br: Ocorreu uma exceção durante a operação de salvar
uk_ua: Під час виконання операції збереження об'єкту сталася помилка

# FetchMethodNameNotSpecified
source: Fetch method name not specified in MobileFactory attribute
de: Fetch Methodenname in MobileFactory Attribut nicht angegeben
pt: Nome do método "fetch" não foi especificado no atributo MobileFactory
pt_br: Nome do método para carregar (fetch) os dados não especificado no atributo MobileFactory

# ObjectTypeCouldNotBeLoaded
source: Object type or assembly could not be loaded ({0})
de: Objekttyp oder Assembly konnte nicht geladen werden ({0})
pt: Não foi possível carregar o tipo do objecto ou "assembly" ({0})
pt_br: Tipo do objeto ou assembly não pode ser carregado ({0})

source: Sorting not supported
de: Sortieren wird nicht unterstützt
pt: Ordenação não é suportada
pt_br: Ordenação não suportada
uk_ua: Можливість сортування не підтримується

# UpdateMethodNameNotSpecified
source: Update method name not specified in MobileFactory attribute
de: Update Methodenname in MobileFactory Attribut nicht angegeben
pt: Nome do método "update" não foi especificado no atributo MobileFactory
pt_br: Nome do método para atualizar (update) não especificado no atributo MobileFactory

# BindingSourceNotProvided
source: A root binding source has not been provided.
de: Eine root-BindingSource wurde nicht bereitgestellt.
pt: Não foi fornecido um "binding source" raiz.
pt_br: Um [binding source] raiz não foi provido.

# MemberNotFoundException
source: Member not found on object ({0})
pt: Membro não foi encontrado no objecto ({0})
pt_br: Membro não encontrado no objeto ({0})

# IManagePropertiesRequiredException
source: Target object must implement IManageProperties
pt: Objecto alvo deve implementar IManageProperties
pt_br: Objeto alvo deve implementar IManageProperties
uk_ua: Цільовий об'єкт повинен реалізовувати інтерфейс IManageProperties

# PropertyRegisterNotAllowed
source: Cannot register property {0} after containing type ({1}) has been instantiated
pt: Não pode registar a propriedade {0} depois de instanciar o tipo ({1}) que a contem
pt_br: Não se pode registrar propriedade {0} após o tipo ({1}) que a contem ter sido instanciado

# IEditableCollectionRequiredException
source: Target object must implement IEditableCollection
pt: Objecto alvo deve implementar IEditableCollection
pt_br: Objeto alvo deve implementar IEditableCollection
uk_ua: Цільовий об'єкт повинен реалізовувати інтерфейс IEditableCollection

# ActionExtenderCloseConfirmation
source: Are you sure you want to close?
pt: Confirma que quer fechar?
pt_br: Tem certeza que quer fechar?
uk_ua: Ви впевнені, що хочете закрити?

# ActionExtenderDirtyWarningMessagePropertyDefault
source: Object is currently in a dirty changed.
pt: Objecto atualmente está sujo.
pt_br: Objeto atualmente está sujo.
uk_ua: Об'єкт в даний час знаходиться в стані 'брудної' зміни.

# ActionExtenderInvalidBindingSourceCast
source: DataSource does not cast to a BindingSource
pt: DataSource não representa um BindingSource
pt_br: DataSource não representa um BindingSource
uk_ua: DataSource не може бути приведеним до типу BindingSource

# ActionExtenderInvalidBusinessObjectBaseCast
source: The underlying data source does not cast to a CSLA BusinessBase object
pt: A fonte de dados base subjacente não representa um objecto CSLA BusinessBase
pt_br: A fonte de dados base não representa um objeto BusinessBase
uk_ua: Базове джерело даних не може бути приведеним до об'єкту типу CSLA BusinessBase

# ActionExtenderSourceMustBeBindingSource
source: DataSource must be a BindingSource control instance
pt: DataSource deve ser uma instância do controle BindingSource
pt_br: DataSource deve ser uma instância do controle BindingSource
uk_ua: DataSource повинен бути екземпляром об'єкту BindingSource

# ActionExtenderWarnOnCancelMessagePropertyDefault
source: Are you sure you want to revert to the previous values?
pt: Confirma que quer reverter para os valores anteriores?
pt_br: Tem certeza que quer reverter para os valores previos?
uk_ua: Ви впевнені, що хочете повернутися до попередніх значень?

# PropertyRegisterDuplicateNotAllowed
source: Cannot register property {0}, a PropertyInfo with the same name already exists.
pt: Não pode registrar a propriedade {0}, pois já existe uma PropertyInfo com o mesmo nome.
pt_br: Não se pode registrar propriedade {0}, uma PropertyInfo com o mesmo nome já existe.

# ExecuteBadParams
source: Method to be executed must have 0 or 2 parameters
pt: Método a executar deve ter 0 ou 2 parâmetros
pt_br: Método a ser executado deve ter 0 ou 2 parâmetros

# ExecuteBadTriggerEvent
source: Trigger event has an unsupported signature
pt: Evento de "trigger" tem uma assinatura não suportada
pt_br: Evento de gatilho com assinatura não suportada

# AddNewCoreMustBeOverriden
source: AddNewCore must be overridden
pt: Deve implementar AddNewCore
pt_br: AddNewCore deve ser sobrescrito

# ChangeReadOnlyListInvalid
source: Can not change a read-only list or collection
pt: Não pode alterar uma lista ou coleção só de leitura
pt_br: Não se pode alterar uma lista ou coleção somente de leitura

# SortedBindingListPropertyNameNotFound
source: PropertyName '{0}' not found in list
pt: Nome da propriedade '{0}' não foi encontrado na lista
pt_br: Nome da propriedade '{0}' não encontrado na lista

source: Indexed expressions must be closed
pt: Expressões indexadas devem ser fechadas
pt_br: Expressões indexadas devem ser fechadas

# NavigatorProviderSetPriorToTriggerEvent
source: Please set NavigatorProvider prior to TriggerEvent property.
pt: Estabeleça o NavigatorProvider antes da propriedade TriggerEvent.
pt_br: Favor estabelecer NavigatorProvider antes da propriedade TriggerEvent.
uk_ua: Будь-ласка, встановіть 'NavigatorProvider' відповідно до властивості 'TriggerEvent'.

# ObjectNotNull
source: Can not set property if data object is not null
pt: Não pode estabelecer propriedade se o objecto de dados não fôr nulo
pt_br: Não se pode estabelecer propriedade se objeto de dados não é nulo

# PropertyNameDoesNotExist
source: The specified property name '{0}' does not exist
pt: Nome da propriedade '{0}' não existe
pt_br: O nome de propriedade especificado '{0}' não existe

# PropertyRequiresIndexArguments
source: This property requires {0} index arguments, {1} were provided
pt: Esta propriedade requer {0} argumentos índice e foram fornecidos {1}
pt_br: Esta propriedade requer {0} argumentos índice, {1} foi provido(s)

# NoSuchMethod
source: No such method {0}
fr: La méthode {0} n'existe pas
pt: O método {0} não existe
pt_br: Não há tal método: {0}
uk_ua: Такого методу не існує {0}

# PropertyIsPrivateField
source: Attempt to read/load private field property in managed properties.
pt: Tentativa de ler/carregar propriedade com campo privado em propriedades "managed".
pt_br: Tentativa de ler/carregar propriedade com campo privado em propriedades gerenciadas.

# ListItemNotAChildException
source: List item must be marked as a child object
pt: Item de lista deve ser marcado como objecto filho
pt_br: Item de lista deve ser marcado como objeto filho
uk_ua: Елемент списку повинен бути позначений як 'child' об'єкт

# PrivateFieldException
source: Properties with private backing fields must be marked as RelationshipTypes.PrivateField
pt: Nas propriedade com campos de rectaguarda privados, estes devem ser marcados como Relationship.PrivateField
pt_br: Nas propriedade com campos de retaguarda privados, estes devem ser marcados como Relationship.PrivateField

source: Warning
fr: Attention
pt: Aviso
pt_br: Aviso
uk_ua: Попередження

# ObjectRulesCannotSetPrimaryProperty
source: Object rule can not have PrimaryPropery.
pt: Regra de objecto não pode ter PrimaryPropery.
pt_br: Regra de objeto não pode ter PrimaryPropery.

# UnandledKNownTypeException
source: Unhandled CSLA Known type was found
pt: Foi encontrado um tipo CSLA conhecido que não é tratado
pt_br: Foi encontrado um tipo CSLA conhecido que não é tratado

# BinaryWriterObjectSerializationException
source: Serialization of type object is not supported.
pt: Serialização do tipo de objecto não é suportada.
pt_br: Serialização do tipo de objeto não é suportada.

# PropertyNotInAffectedPropertiesException
source: Property {0} must be added to AffectedProperties.
pt: Propriedade {0} tem que ser acrescentada às AffectedProperties.
pt_br: Propriedade {0} tem que ser acrescentada às AffectedProperties.

# PropertyNameNotRegisteredException
source: Property '{0}' not registered.
pt: Propriedade '{0}' não está registada.
pt_br: A propriedade '{0}' não está registada.

# RuleMessageRequired
source: Message for broken rule is required. Rule: {0}
pt: É exigida a mensagem para a regra violada. Regra: {0}
pt_br: É requerida a mensagem para a regra violada. Regra: {0}

# TaskOfObjectException
source: Method {0} must return Task<object>
pt: Método {0} deve retornar uma Task<object>
pt_br: Método {0} deve retornar uma Task<object>
uk_ua: Метод '{0}' повинен повертати значення типу 'Task<object>'

# AsyncLoadException
source: Failed on async load of property {0}
pt: Falha no carregamento assíncrono da propriedade {0}
pt_br: Falha no carregamento assíncrono da propriedade {0}
uk_ua: Збій при виконанні асинхронного завантаження властивості {0}

# ActionExtenderErrorCaption
source: Error
fr: Erreur
pt: Erro
pt_br: Erro
uk_ua: Помилка

# ActionExtenderInformationCaption
source: Information
pt: Informação
pt_br: Informação
uk_ua: Інформація

# ActionExtenderObjectIsValidMessagePropertyDefault
source: Object is valid
pt: O objecto é válido
pt_br: O objeto é válido
uk_ua: Стан об'єкту є допустимим

# AsyncMethodOnSyncClientNotAllowed
source: Cannot synchronously call {0} which is an asynchronous method
fr: Impossible d'appeler de manière synchrone {0}, qui est une méthode asynchrone
pt: Não é possível chamar de forma síncrona {0}, que é um método assíncrono
pt_br: Não é possível chamar de forma síncrona {0}, que é um método assíncrono
