Repository: MarimerLLC/csla
Catalog: Source/Csla.Shared.Resources/Resources.*.resx
Languages: ca_es, de, fr, he_il, hu, it, km_kh, nl, pt, pt_br, sr, uk_ua, zh_hans

# ClearInvalidException
source: Clear is an invalid operation
ca_es: Clear és una operació invàlida
de: Clear ist eine ungültige Operation
fr: Nettoyer (clear) est une opération invalide
he_il: היא פעולה שגוייה Clear
hu: Clear érvénytelen művelet
it: Clear è un operazione non valida
km_kh: ដំណើរការ លុបមិនត្រឹមត្រូវ
nl: leeg maken is een ongeldige bewerking
pt: "Clear" é uma operação inválida
pt_br: Limpar é uma operação inválida
sr: Čišćenje nije dozvoljeno
uk_ua: Операція 'Clear' є неприпустимою
zh_hans: 清除属非法操作

# InsertInvalidException
source: Insert is an invalid operation
ca_es: Inserir (insert) és una operació invàlida
de: Einfügen ist eine ungültige Operation
fr: Insérer (insert) est une opération invalide
he_il: הוספה היא פעולה אסורה
hu: Insert érvénytelen művelet
it: Insert è un operazione non valida
km_kh: ប្រតិបត្តិការ បន្ថែមទិន្នន័យ ពុំមានសុពលភាព ។
nl: toevoegen is een ongeldige bewerking
pt: Inserir é uma operação inválida
pt_br: Inserir é uma operação inválida
sr: Dodavanje nije dozvoljeno
uk_ua: Операція 'Insert' є неприпустимою
zh_hans: 插入属非法操作

# RemoveInvalidException
source: Remove is an invalid operation
ca_es: Remove és una operació invàlida
de: Entfernen ist eine ungültige Operation
fr: "Retirer" (Remove) est une opération invalide
he_il: הסרה הוא פעולה שגוייה
hu: Remove érvénytelen művelet
it: Remove è un operazione non valida
km_kh: ប្រតិបត្តិការ ដកចេញពុំមានសុពលភាព ។
nl: Verwijderen is een ongeldige bewerking
pt: Remover é uma operação inválida
pt_br: Remover é uma operação inválida
sr: Uklanjanje nije dozvoljeno
uk_ua: Операція 'Remove' є неприпустимою
zh_hans: 删除属无效操作

# ChangeInvalidException
source: Changing an element is an invalid operation
ca_es: Canviar un element és una operació invàlida
de: Ändern eines Elementes ist eine ungültige Operation
fr: Changer un élément est une opération invalide
he_il: אסור לשנות אלמנט
hu: Egy elem megváltoztatása érvénytelen művelet
it: Cambiare un elemento è una operazione non valida
km_kh: ប្រតិបត្តិការផ្លាស់ប្តូរធាតុ គ្មានសុពលភាព
nl: Het wijzigen van een element is een ongeldige bewerking
pt: Alterar um elemento é uma operação inválida
pt_br: Alterar um elemento é uma operação inválida
sr: Izmena nije dozvoljena
uk_ua: Редагування елементу являється неприпустимою операцією
zh_hans: 改变一个元素属非法操作

# ChildDeleteException
source: Can not directly mark a child object for deletion - use its parent collection
ca_es: No es pot marcar directament un objecte fill per a esborrar-lo - utilitzeu la col·lecció pare
de: Kann ein Kindobjekt nicht direkt zum Löschen markieren - benutzen Sie die übergeordnete Liste
fr: Un objet enfant ne peux être directement marqué pour effacement - Utilisez la collection qui le contient
he_il: לא ניתן למחוק אוביקט ילד ישירות - יש להשתמש באוסף האב
hu: Egy alobjektumot nem lehet közvetlenül törlésre kijelölni - használja a felettes gyűjteményét
it: Non è possibile marcare direttamente un elemento Child per la cancellazione - usare la sua collezione Parent
km_kh: មិនអាចកំណត់សំគាល់ object​ ដើម្បីលុបដោយផ្ទាល់បានទេ អ្នកគួរតែលុបវាតាមរយៈ object មេរបស់វា ។
nl: Kan geen child object markeren om te verwijderen - gebruik de parent collectie
pt: Não pode marcar directamente um objecto filho para apagar - use a colecção pai
pt_br: Não se pode marcar diretamente um objeto filho para deleção - use a coleção pai dele
sr: Objekti "deca" se ne mogu direktno označiti za brisanje - koristite "roditelj" kolekciju
uk_ua: Не можливо напряму помітити дочірній об'єкт для видалення - використовуйте для цього його батьківську колекцію
zh_hans: 不能直接将子对象标记为删除对象 – 请通过其 Parent 集合

# NoDeleteRootException
source: Invalid for root objects - use Delete instead
ca_es: Invàlid per a objectes arrel - utilitzeu Delete en el seu lloc
de: Ungültig für Root Objekte - stattdessen löschen
fr: Invalide pour les objets racine - Utilisez plutôt "Effacer" (Delete)
he_il: פעולה שגויה על אוביקט שורש - השתמש ב- Delete במקום
hu: Érvénytelen főobjektumokon - Delete használható helyette
it: Non valido per oggetti root - usare invece Delete
km_kh: មិនមានសុពលភាពសំរាប់កម្មវត្ថុមេ - ប្រើ Delete​ ជំនួសវិញ
nl: Niet toegestaan voor root objecten - gebruik verwijderen
pt: Inválido para objectos raíz - em vez disso, use "Delete"
pt_br: Inválido para objetos raiz - use Deletar ao invés
sr: Nedozvoljena operacija za osnovne objekte - koristite Delete
uk_ua: Невірно для кореневих об'єктів - натомість використовуйте операцію 'Delete'
zh_hans: 不能用于源对象 – 请用删除

# NoSaveChildException
source: Can not directly save a child object
ca_es: No es por guardar un objecte fill directament
de: Ein Kindobjekt kann nich direkt gespeichert werden
fr: Un objet enfant ne peux être directement sauvegardé
he_il: לא ניתן לשמור ישירות אוביקט ישל
hu: Egy alobjektumot nem lehet közvetleneül elmenteni
it: Non è possibile salvare direttamente un oggetto child
km_kh: មិនអាចរក្សាទុក កម្មវត្ថុកូនដោយផ្ទាល់បានទេ ។
nl: Het is niet toegestaan om een rechtstreeks een child object te bewaren
pt: Não pode guardar objectos filho directamente
pt_br: Não se pode salvar diretamente um objeto filho
sr: "Dete" objekat se ne može direktno sačuvati
uk_ua: Не можливо напряму зберегти дочірній об'єкт
zh_hans: 不能直接保存子对象

# NoSaveEditingException
source: Object is still being edited and can not be saved
ca_es: L'objecte està en ús i no pot ser desat
de: Objekt wird noch editiert und kann nicht gespeichert werden
fr: Impossible de sauvegarder l'objet car il est en cours d'édition
he_il: אוביקט עדיין במצב עריכה ולכן לא ניתן לשמור
hu: Az objektum még szerkesztési módban van és nem lehet elmenteni
it: L'oggetto è ancora in edit e non può essere salvato
km_kh: កម្មវត្ថុ កំពុងតែស្ថិតក្នុងស្ថានភាពកំណែ មិនអាចរក្សាទុកបានទេ ។
nl: Object wordt nog gewijzigd - bewaren is niet toegestaan
pt: O objecto está a ser editado e não pode ser guardado
pt_br: Objeto ainda está sendo editado e não pode ser salvo
sr: Objekat se još uvek uređuje i ne može biti sačuvan
uk_ua: Не можливо зберегти об'єкт, що знаходиться в стані редагування
zh_hans: 不能保存, 因为对象还在修改状态中

# NoSaveInvalidException
source: Object is not valid and can not be saved
ca_es: L'objecte no és vàlid i no pot ser desat
de: Objekt ist ungültig und kann nicht gespeichert werden
fr: Impossible de sauvegarder l'objet car il possède des erreurs
he_il: אוביקט לא תקין ולכן לא ניתן לשמור
hu: Az objektum érvénytelen és nem lehet elmenteni
it: L'oggetto non è valido e non può essere salvato
km_kh: កម្មវត្ថុ មិនមានសុពលភាពនឹងរក្សាទុកបានទេ ។
nl: Validatie van het object is niet geldig - bewaren is niet toegestaan
pt: O objecto não é válido e não pode ser guardado
pt_br: Objeto não é válido e não pode ser salvo
sr: Objekat nije ispravan i ne može biti sačuvan
uk_ua: Не можливо зберегти об'єкт, який містить помилкові дані
zh_hans: 对象含无效值, 因此不能保存

# CreateNotSupportedException
source: Invalid operation - create not allowed
ca_es: Operació invàlida - no està permès crear (create)
de: Ungültige Operation - Erzeugen nicht erlaubt
fr: Opération invalide - Créer (create) n'est pas permis
he_il: פעולה שגויה - לא ניתן ליצור
hu: Érvénytelen művelet - a létrehozás nem megengedett
it: Operazione non valida - create non consentito
km_kh: ប្រតិបត្តិការណ៌មិនត្រឹមត្រូវ - មិនអនុញ្ញាត្តិអោយបង្កើត
nl: ongeldige bewerking - aanmaken is niet toegestaan
pt: Operação inválida - não é permitido criar
pt_br: Operação inválida - Criar não permitida
sr: Nedozvoljena operacija - kreiranje
uk_ua: Неприпустима операція - створення об'єкту заборонено
zh_hans: 非法操作 – 不允许创建

# FetchNotSupportedException
source: Invalid operation - fetch not allowed
ca_es: Operació invàlida - lectura (fetch) no permesa
de: Ungültige Operation - Abrufen nicht erlaubt
fr: Opération invalide - Charger (fetch) n'est pas permis
he_il: פעולה שגויה - לא ניתן למשוך
hu: Érvénytelen művelet - a lehívás nem megengedett
it: Operazione non valida - Fetch non è consentito
km_kh: ប្រតិបត្តិការពុំមានសុពលភាព - ការទាញយកទិន្នន័យមិនត្រូវបានអនុញ្ញាត្តិ ។
nl: ongeldige bewerking - ophalen is niet toegestaan
pt: Operação inválida - não é permitido ler
pt_br: Operação inválida - Buscar/Carregar não permitida
sr: Nedozvoljena operacija - učitavanje
uk_ua: Неприпустима операція - зчитування об'єкту заборонено
zh_hans: 非法操作 – 不允许读取数据

# UpdateNotSupportedException
source: Invalid operation - update not allowed
ca_es: Operació invàlida - no està permès actualitzar (update)
de: Ungültige Operation - Aktualisieren nicht erlaubt
fr: Operation invalide - mise à jour (update) n'est pas permis
he_il: פעולה שגויה - לא ניתן לעדכן
hu: Érvénytelen művelet - a módosítás nem megengedett
it: Operazione non valida - Update non è consentito
km_kh: ប្រតិបត្តិការណ៌គ្មានសុពលភាព - មិនអនុញ្ញាត្តិអោយលុបទិន្នន័យ
nl: ongeldige bewerking - wijzigen is niet toegestaan
pt: Operação inválida - não é permitido actualizar
pt_br: Operação inválida - Atualizar não permitida
sr: Nedozvoljena operacija - ažuriranje
uk_ua: Неприпустима операція - запис/редагування об'єкту заборонено
zh_hans: 无效操作 –不允许更新

# DeleteNotSupportedException
source: Invalid operation - delete not allowed
ca_es: Operació invàlida - no està permès esborrar (delete)
de: Ungültige Operation - Löschen nicht erlaubt
fr: Opération invalide - Effacer (delete) n'est pas permis
he_il: פעולה שגויה - לא ניתן למחוק
hu: Érvénytelen művelet - a törlés nem megengedett
it: Operazione non valida - Delete non consentito
km_kh: ប្រតិបត្តិការណ៌មិនត្រឹមត្រូវ - មិនអនុញ្ញាត្តិអោយលុប
nl: ongeldige bewerking - verwijderen is niet toegestaan
pt: Operação inválida - não é permitido apagar
pt_br: Operação inválida - Deletar não permitida
sr: Nedozvoljena operacija - brisanje
uk_ua: Неприпустима операція - видалення об'єкту заборонено
zh_hans: 非法操作 – 不允许删除

# NoBeginEditChildException
source: BeginEdit is not valid on a child object
ca_es: BeginEdit no és vàlid en un objecte fill
de: BeginEdit kann nicht auf ein Kindobjekt angewandt werden
fr: Opération invalide - "BeginEdit" n'est pas permis sur un objet enfant
he_il: BeginEdit- פעולה שגויה על אוביקט ילד
hu: BeginEdit érvénytelen egy alobjektumon
it: BeginEdit non è consentito su un oggetto child
km_kh: BeginEdit មិនមានសុពលភាព សំរាប់កម្មវត្ថុកូនទេ​ ។
nl: BeginEdit is een ongeldige bewerking voor een child object
pt: BeginEdit não é válido para um objecto filho
pt_br: BeginEdit não é válido em um objeto filho
sr: BeginEdit nije važeći na "dete" objektu
uk_ua: Операція 'BeginEdit' є неприпустимою для дочірніх об'єктів
zh_hans: BeginEdit 在子对象上无效

# NoCancelEditChildException
source: CancelEdit is not valid on a child object
ca_es: CancelEdit no és vàlid en un objecte fill
de: CancelEdit kann nicht auf ein Kindobjekt angewandt werden
fr: Opération invalide - "CancelEdit" n'est pas permis sur un objet enfant
he_il: CancelEdit - פעולה שגויה על אוביקט ילד
hu: CancelEdit érvénytelen egy alobjektumon
it: CancelEdit non è consentito su un oggetto child
km_kh: CancelEdit មិនមានសុពលភាព សំរាប់កម្មវត្ថុកូនទេ​ ។
nl: CancelEdit is een ongeldige bewerking voor een child object
pt: CancelEdit não é válido para um objecto filho
pt_br: CancelEdit não é válido em um objeto filho
sr: CancelEdit nije važeći na "dete" objektu
uk_ua: Операція 'CancelEdit' є неприпустимою для дочірніх об'єктів
zh_hans: CancelEdit 在子对象上无效

# NoApplyEditChildException
source: ApplyEdit is not valid on a child object
ca_es: ApplyEdit no és vàlid en un objecte fill
de: ApplyEdit kann nicht auf ein Kindobjekt angewandt werden
fr: Opération invalide - "ApplyEdit" n'est pas permis sur un objet enfant
he_il: ApplayEdit - פעולה שגויה על אוביקט ילד
hu: ApplyEdit érvénytelen egy alobjektumon
it: ApplyEdit non è consentito su un oggetto child
km_kh: ApplyEdit មិនមានសុពលភាព សំរាប់កម្មវត្ថុកូនទេ​ ។
nl: ApplyEdit is een ongeldige bewerking voor een child object
pt: ApplyEdit não é válido para um objecto filho
pt_br: ApplyEdit não é válido em um objeto filho
sr: ApplyEdit nije važeći na "dete" objektu
uk_ua: Операція 'ApplyEdit' є неприпустимою для дочірніх об'єктів
zh_hans: ApplyEdit 在子对象上无效

# NoSuchValueExistsException
source: No such value exists:
ca_es: No existeix el valor:
de: Wert existiert nicht:
fr: Cette valeur n'existe pas:
he_il: לא קיים ערך:
hu: Nincs ilyen érték:
it: Non esiste il valore:
km_kh: គ្មានតម្លៃនេះទេ:
nl: de volgende waarde bestaat niet:
pt: O valor não existe:
pt_br: Não há tal valor:
sr: Ne postoji vrednost:
uk_ua: Такого значення не існує:
zh_hans: 此数值不存在:

# ErrorReadingValueException
source: Error reading value:
ca_es: Error llegint el valor:
de: Fehler beim Lesen des Werts:
fr: Erreur lors de la lecture de cette valeur:
he_il: ערך שגוי
hu: Hiba az érték olvasása során:
it: Errore durante la lettura del valore:
km_kh: កំហុសក្នុងការអានតម្លៃ​
nl: Fout tijdens het lezen van de waarde:
pt: Erro ao ler valor:
pt_br: Erro ao ler valor:
sr: Greška pri čitanju vrednosti:
uk_ua: Помилка зчитування значення:
zh_hans: 读取数值出错:

# StringToDateException
source: String value can not be converted to a date
ca_es: El valor de tipus String no pot ser convertit a una data
de: Zeichenfolge kann nicht in ein Datum konvertiert werden
fr: Cette chaine de caractère ne peux être convertis en type "Date"
he_il: לא ניתן להסב מחרוזת לתאריך
hu: A szöveget nem lehet dátummá alakítani
it: il valore stringa non può essere convertito in data
km_kh: ខ្សែរអក្សរ មិនអាចបំលែងទៅជា ថ្ងៃខែទេ ។
nl: Een string waarde kan niet geconverteerd worden naar een datum waarde
pt: A cadeia de caracteres não pode ser convertido numa data
pt_br: Valor do tipo string não pode ser convertido para uma data
sr: String vrednost ne može biti konvertovana u datum
uk_ua: Не можливо переконвертовати даний символьний рядок в дату
zh_hans: 字符串不能转化成日期

# ValueNotSmartDateException
source: Value is not a SmartDate
ca_es: El valor no és un SmartDate
de: Wert ist kein SmartDate
fr: La valeur (Value) n'est pas du type "SmartDate"
he_il: ערך לא במיבנה של SmartDate
hu: Az érték nem SmartDate
it: Value non è una SmartDate
km_kh: តម្លៃដែលផ្តល់មិនមែនជា SmartDate
nl: Waarde is geen SmartDate
pt: O valor não é uma SmartDate
pt_br: Valor não é uma SmartDate
sr: Vrednost nije tipa SmartDate
zh_hans: 数值不是SmartDate 类型

# NoPrincipalAllowedException
source: No principal object should be passed to DataPortal when using Windows integrated security
ca_es: No s'hauria de passar un objecte principal al DataPortal quan s'utilitza la seguretat integrada de Windows
de: Bei Windows Authentifizierung sollte kein Principal Objekt an das DataPortal übergeben werden
fr: Un objet "Principal" ne doit être passé au "DataPortal" lorsque la sécurité intégrée à Windows est utilisée
hu: Integrált Windows biztonság esetén nem szabad Principal objektumot átadni a DataPortal-nak
it: Non si deve passare un oggetto Principal al DataPortal quando si usa l'autenticazione integrata di Windows
km_kh: មិនចាំបាច់បញ្ជូន កម្មវត្ថុស្តីពីគោលការប្រើប្រាស់ ទៅ DataPortal នៅពេលដែសប្រើ Windows integrated security
nl: Er mag geen principal object naar de DataPortal gestuurd worden wanneer men gebruik maakt van Windows integrated security
pt: Nenhum objecto "Principal" deve ser passado para o DataPortal, quando se usa a segurança integrada do Windows
pt_br: Nenhum objeto do tipo Principal deve ser passado para um DataPortal quando segurança integrada do Windows estiver sendo usada
sr: Principal objekat ne može biti prosleđen DataPortal-u kada se koristi integrisana Windows sigurnost
uk_ua: Не варто передавати жодних 'principal' об'єктів в 'DataPortal' при використанні вбудованої системи безпеки Windows
zh_hans: 使用视窗集成的安全模式时, 不能将主名对象传送给DataPortal

# BusinessPrincipalException
source: Principal must be of type BusinessPrincipal, not
ca_es: El Principal ha de ser del tipus BusinessPrincipal, no
de: Principal muss vom Typ BusinessPrincipal sein, nicht
fr: Le "Principal" doit être du type "BusinessPrincipal" et non du type
hu: A Principal típusa csak BusinessPrincipal lehet, nem pedig
it: Principal deve essere del tipo BusinessPrincipal, non
km_kh: គោលការណ៌ ត្រូវតែជាប្រភេទ BusinessPrincipal មិនមែនជា
nl: Principal moet type BusinessPrincipal zijn, niet:
pt: "Principal" tem que ser do tipo BusinessPrincipal, não
pt_br: Principal deve ser do tipo BusinessPrincipal, não
sr: Principal objekat mora biti tipa BusinessPrincipal, a ne
uk_ua: Об'єкт 'Principal' повинен бути типу 'BusinessPrincipal', а не
zh_hans: 主名必须是 BusinessPrincipal 的类型, 不能是

# SmartDateT
source: t
de: h
fr: a
hu: m
it: o
nl: v
pt: h
zh_hans: 今天

# SmartDateToday
source: today
ca_es: today (avui)
de: heute
fr: aujourd'hui
he_il: היום
hu: ma
it: oggi
nl: vandaag
pt: hoje
pt_br: hoje
uk_ua: сьогодні
zh_hans: 今天

# SmartDateY
source: y
de: g
fr: h
hu: t
it: i
nl: g
pt: o
zh_hans: 昨天

# SmartDateYesterday
source: yesterday
ca_es: yesterday (ahir)
de: gestern
fr: hier
he_il: אתמול
hu: tegnap
it: ieri
nl: gisteren
pt: ontem
pt_br: ontem
uk_ua: вчора
zh_hans: 昨天

# SmartDateTom
source: tom
de: m
fr: d
hu: h
it: d
nl: m
pt: a
zh_hans: 明天

# SmartDateTomorrow
source: tomorrow
ca_es: tomorrow (demà)
de: morgen
fr: demain
he_il: מחר
hu: holnap
it: domani
nl: morgen
pt: amanhã
pt_br: amanhã
uk_ua: завтра
zh_hans: 明天

source: failed
ca_es: ha fallat
de: fehlgeschlagen
fr: a échoué
he_il: כישלון
hu: nem sikerült
it: Fallito
km_kh: បរាជ័យ
nl: mislukt
pt: falhou
pt_br: falhou
uk_ua: зазнав краху
zh_hans: 失败

# FailedOnServer
source: failed on the server
ca_es: ha fallat en el servidor
de: auf dem Server fehlgeschlagen
fr: a échoué sur le serveur
he_il: כישלון בצד השרת
hu: nem sikerült a kiszolgálón
it: Fallito sul server
km_kh: បរាជ័យនៅ ម៉ាស៊ីនមេ
nl: mislukt op de server
pt: falhou no servidor
pt_br: falhou no servidor
uk_ua: зазнав краху на сервері
zh_hans: 伺服器出错

source: method call failed
ca_es: Ha fallat la crida al mètode
de: Methodenaufruf fehlgeschlagen
fr: L'appel à la méthode a échoué
he_il: כישלון בקריאה לפונקציה
hu: metódus hívása nem sikerült
it: chiamata a metodo fallita
km_kh: ការប្រើប្រាស់ វិធីសាស្រ្ត បានបរាជ័យ
nl: methode aanroepen mislukt
pt: chamada ao método falhou
pt_br: chamada do método falhou
uk_ua: Виклик методу зазнав краху
zh_hans: 调用函数失败

# MethodNotImplemented
source: not implemented
ca_es: no implementat
de: nicht implementiert
fr: non implanté
he_il: לא מיוסם
hu: nincs megvalósítva
it: non implementato
km_kh: មិនទាន់ប្រតិបត្តិ នៅឡើយទេ ។
nl: niet geimplementeerd
pt: não implementado
pt_br: não implementado
zh_hans: 尚未实现

# ExecuteNotSupportedException
source: Invalid operation - execute not allowed
ca_es: Operació invàlida - no està permès executar (execute)
de: Ungülitge Operation - Ausführen nicht erlaubt
fr: Opération invalide - Exécuter (execute) n'est pas permis
he_il: פעולה שגויה - לר ניתן להריץ
hu: Érvénytelen művelet - a végrehajtás nem megengedett
it: Operazione non valida - Execute non è consentito
km_kh: ប្រតិបត្តិការពុំមានសុពលភាព - ដំណើរការនេះមិនត្រូវបានអនុញ្ញាត្តិ ។
nl: ongeldige bewerking - uitvoeren is niet toegestaan
pt: Operação inválida - não é permitido executar
pt_br: Operação inválida - Executar não permitida
uk_ua: Неприпустима операція - метод виконання заборонено
zh_hans: 非法操作 – 不允许执行

# InsertNotSupportedException
source: Invalid operation - insert not allowed
ca_es: Operació invàlida - no està permès inserir (insert)
de: Ungülitge Operation - Einfügen nicht erlaubt
fr: Opération invalide - Insérer (insert) n'est pas permis
he_il: פעולה אסורה - לא ניתן להוסף
hu: Érvénytelen művelet - a felvétel nem megengedett
it: Operazione non valida - Insert non è consentito
km_kh: ប្រតិបត្តិការពុំមានសុពលភាព - ការបន្ថែមទិន្នន័យមិនត្រូវបានអនុញ្ញាត្តិ ។
nl: ongeldige bewerking - toevoegen is niet toegestaan
pt: Operação inválida - não é permitido inserir
pt_br: Operação inválida - Inserir não permitida
uk_ua: Неприпустима операція - вставка об'єкту заборонена
zh_hans: 非法操作 – 不允许插入

source: Property get not allowed
ca_es: No està permès recuperar el valor de la propietat (get)
de: Lesen der Eigenschaft nicht erlaubt
fr: Le "get" n'est pas permis pour cette propriété
he_il: לא ניתן למשוך נתונים מתְּכוּנָה
hu: Tulajdonság olvasása nem megengedett
it: Property get non consentito
km_kh: ការអាន លក្ខណៈសម្បត្តិ មិនត្រូវបានអនុញ្ញាត្តិ
nl: Property get is niet toegestaan
pt: Não é permitido ler o valor da propriedade
pt_br: 'Property get' não permitida
zh_hans: 不允许 get 属性

source: Property set not allowed
ca_es: No està permès establir un valor a la propietat (set)
de: Setzen der Eigenschaft nicht erlaubt
fr: Le "set" n'est pas permis pour cette propriété
he_il: לא ניתן לבצע השמה
hu: Tulajdonság írása nem megengedett
it: Property set non consentito
km_kh: ការកំណត់ លក្ខណៈសម្បត្តិ មិនត្រូវបានអនុញ្ញាត្តិ
nl: Property set is niet toegestaan
pt: Não é permitido atribuir valor à propriedade
pt_br: 'Property set' não permitida
uk_ua: Присвоєння значення для властивості заборонено
zh_hans: 不允许 set 属性

# NothingNotValid
source: Argument must not be Nothing
ca_es: L'argument no pot ser nul
de: Argument darf nicht leer sein
fr: Cet argument ne peut être nul (Nothing)
he_il: פרמטר חייב להיות שונה מ-"כלום"
hu: Az argumentum nem lehet null érték
it: Argument non deve essere Nothing
km_kh: អាគុយម៉ង មិនអាចទទេបានទេ ។
nl: Argument mag niet Nothing(leeg) zijn
pt: O argumento não pode ser nulo
pt_br: Argumento não pode ser nulo
zh_hans: 参数不能是空值 (Nothing)

source: Property copy failed
ca_es: Ha fallat la còpia de la propietat
de: Kopieren einer Eigenschaft fehlgeschlagen
fr: La copie (copy) de cette propriété a échoué
he_il: העתקת תְּכוּנָה נכשלה
hu: Tulajdonság másolása nem sikerült
it: Copia della proprietà fallita
km_kh: បរាជ័យក្នុងការចំលង លក្ខណៈសម្បត្តិ
nl: Kopiëren van de property is mislukt
pt: A cópia da propriedade falhou
pt_br: Cópia da propriedade falhou
zh_hans: 拷贝属性失败

# MaxValueRule
source: {0} can not exceed {1}
ca_es: {0} no pot excedir de {1}
de: {0} kann nicht grösser sein als {1}
fr: la valeur de {0} ne peut pas être supérieure à {1}
hu: {0} nem lehet nagyobb mint {1}
km_kh: {0} មិនអាចលើសពី {1}
nl: {0} kan niet groter zijn dan {1}
pt: {0} não pode exceder {1}
pt_br: {0} não pode exceder {1}
uk_ua: {0} не може перевищувати {1}

# MinValueRule
source: {0} can not be less than {1}
ca_es: {0} no pot ser menor que {1}
de: {0} kann nicht kleiner sein als {1}
fr: la valeur de {0} ne peut pas être inférieure à {1}
hu: {0} nem lehet kisebb mint {1}
km_kh: {0} មិនអាចតិចជាង {1}
nl: {0} kan niet kleiner zijn dan {1}
pt: {0} não pode ser menos que {1}
pt_br: {0} não pode ser menor que {1}
uk_ua: {0} не може бути меньше {1}

# StringMaxLengthRule
source: {0} can not exceed {1} characters
ca_es: {0} no pot excedir de {1} caràcters
de: {0} darf maximal {1} Zeichen lang sein
fr: la longueur de {0} ne peut pas dépasser {1} caractères
hu: {0} nem lehet hosszabb {1} karakternél
km_kh: {0} មិនអាចលើសពី {1} តួអក្សរ
nl: {0} kan niet meer dan {1} karakters hebben
pt: {0} não pode exceder {1} caracteres
pt_br: {0} não pode exceder {1} caracteres
uk_ua: Поле '{0}' не може перевищувати {1} символу(ів)

# StringRequiredRule
source: {0} required
ca_es: {0} obligatori
de: {0} erforderlich
fr: {0} obligatoire
hu: {0} kötelező
km_kh: {0} ត្រូវការចាំបាច់
nl: {0} verplicht
pt: {0} exigido
pt_br: {0} requerido
uk_ua: Поле '{0}' не може бути пустим

# RegExMatchRule
source: {0} does not match regular expression
ca_es: {0} no coincideix amb l'expressió regular
de: {0} entspricht nicht dem regulären Ausdruck
fr: {0} ne vérifie pas l'expression régulière
hu: {0} nem felel meg a regex mintának
km_kh: {0} មិនត្រូវគ្នា នឹងកន្សោមធម្មតាទេ ។
nl: {0} komt niet overeen met de regular expression
pt: {0} não encaixa na expressão regular
pt_br: {0} não confere com 'expressão regular [regular expression]
uk_ua: {0} не відповідає регулярному виразу
